{
  "about.1": "Hi I’m Juanse, I’m a <strong>designer</strong> <emoji>👨‍🎨</emoji> and <strong>web developer</strong> <emoji>👨‍💻</emoji> as my current profession with over 4 years of experience using <strong>HTML</strong>, <strong>CSS</strong>, and <strong>JavaScript</strong> as my programming tools <emoji>🛠</emoji>. I have an active knowledge of <strong>React</strong>, <strong>Redux</strong>, <strong>Webpack</strong>, and the ecosystem around these technologies.",
  "about.2": "I have good communication skills and I'm proficient working in English <emoji>🤓</emoji> and I’ve used agile methodologies such as <strong>Scrum</strong> and <strong>Kanban</strong>. My development knowledge and design knowledge allow me to transform designs and creative ideas into digital products like web/apps. <emoji>🚀</emoji>",
  "nav.home": "Home",
  "nav.about": "About",
  "nav.work": "Work Experience",
  "nav.contact": "Contact",
  "nav.skip": "Skip to content",
  "nav.top": "Back to top",
  "nav.dark": "Dark mode",
  "download": "Download CV",
  "experience.lean": "Lean Tech",
  "experience.lean.1": "I’m <strong>Sr. FrontEnd developer</strong> for a <strong>Arrive</strong> (a logistics company), in the team we’re building new modules/features for a platform <strong>(a web app)</strong> that are used by all the customers to manage the business.",
  "experience.lean.2": "One of the biggest challenge is to keep all the clients syncs in <strong>real time</strong> and notify updates about loads, carriers, trucks, etc.",
  "experience.lean.3": "We created a notification panel that shows the best load option for the users based on their requirements in <strong>real time</strong>.",
  "experience.lean.4": "I did the setup for a new project from scratch using <strong>Webpack</strong>, <strong>React</strong>, <strong>TypeScript</strong>, <strong>Styled Components</strong>, <strong>Jest</strong>, <strong>Testing Library</strong> and <strong>Apollo Graphql</strong>.",
  "experience.lean.5": "I led the unit/integration testing strategy.",
  "experience.lean.6": "I defined some of the <strong>coding standards</strong>, <strong>naming conventions</strong> and <strong>architecture</strong> for our projects",
  "experience.lean.7": "I did a migration from <strong>Redux</strong> to <strong>Apollo Graphql</strong>",
  "experience.lean.8": "We use <strong>websocket</strong> and <strong>Azure</strong> capabilities to process and sync all the clients and <strong>Okta</strong> to manage the access based on permissions and business rules.",
  "experience.huge": "Huge",
  "experience.huge.1": "I’m Web Developer for <strong>Google</strong>. I’m in charge of <strong>maintaining</strong> and <strong>implementing</strong> new design feature to improve the <strong>user experience</strong> in different websites and web apps that have a high volume of users per day, also, I have to keep high <strong>accessibility</strong> standards and <strong>performance</strong> in order to be accessible around the world.",
  "experience.huge.2": "I develop reusable and responsive components to visualize different multimedia content.",
  "experience.huge.3": "I do some POCs to presents proposals to the clients.",
  "experience.huge.4": "I lead testing strategies for web apps.",
  "experience.huge.5": "I’ve done project structures changes to improve <strong>scalability</strong> and <strong>maintainability</strong>.",
  "experience.huge.6": "My main tools are <strong>HTML</strong>, <strong>CSS</strong> and <strong>JavaScript</strong> but in some projects I used <strong>Preact</strong>, <strong>TweenLite</strong> and <strong>Sass</strong>.",
  "experience.psl": "PSL",
  "experience.psl.1": "I worked as Web Developer using <strong>React</strong>, <strong>Redux</strong>, <strong>PostCss</strong>, <strong>Sass</strong> and <strong>Webpack</strong>.",
  "experience.psl.2": "I developed reusable components in <strong>React</strong> using the new <strong>EcmaScript</strong> specifications and <strong>PostCss</strong> as CSS preprocessor.",
  "experience.psl.3": "I did some project structure changes in the projects to improve the scalability.",
  "experience.psl.4": "I used advanced <strong>testing techniques</strong> and automation and static code analysis.",
  "experience.psl.5": "I defined some of the strategies to handle and structure the data in the web app.",
  "experience.psl.6": "I optimized the <strong>CSS</strong> and applied visual improvements defined by design team after a user experience research.",
  "experience.psl.7": "In the project I used/applied concepts and methodologies such ass <strong>Continuous Deployment</strong>, <strong>Box Model</strong>, <strong>CSS Module</strong>, <strong>WebComponents</strong>, <strong>Global State</strong>, <strong>Responsive Design</strong> and <strong>Scrum</strong>.",
  "experience.freelance": "Freelance",
  "experience.freelance.1": "I worked in a start-up project called TuPeludo.",
  "experience.freelance.2": "I developed a <strong>web app</strong> where the user looked for a dog walker service.",
  "experience.freelance.3": "I automated the register process for the dog walker.",
  "experience.freelance.4": "I developed many reusable components using React.",
  "experience.freelance.5": "My main tools were <strong>React</strong>, <strong>Sass</strong>, <strong>Redux</strong> and <strong>Firebase</strong>."
}
