{
  "about": "Hi I’m Juanse, graduated as designer and web developer as my current profession with over 4 years of experience using HTML, CSS and JavaScript as my programming tools, I’m based on Sabaneta, Colombia. I have good and active knowledge of React, Redux, Webpack and the ecosystem around these technologies. I have good communication skills, I’ve work in multiple projects with different people from many different places and cultures. I have very  good English level and I’ve used agile methodologies such as Scrum and Kanban. My development knowledge and design knowledge allow me to transform designs and ideas from my partners and I into a digital product like web/app",
  "nav.about": "About",
  "nav.work": "Work Experience",
  "nav.contact": "Contact",
  "download": "Dwonload CV",
  "experience.huge": "Huge",
  "experience.huge.1": "I’m web developer for Google. I’m in charge of maintaining and implementing new design feature to improve the user experience in different websites and web apps that have a high volumen of users per day, also, I have to keep high accessibility standards and performance in order to be accessible around the world.",
  "experience.huge.2": "I develop reusable and responsive components to visualize different multimedia content.",
  "experience.huge.3": "I do some POCs to presents proposals to the clients.",
  "experience.huge.4": "I lead testing strategies for web apps.",
  "experience.huge.5": "I’ve done project structures changes to improve scalability and maintainability.",
  "experience.huge.6": "My main tools are HTML, CSS y JavaScript but in some projects I used Preact, TweenLite and Sass.",
  "experience.psl": "PSL",
  "experience.psl.1": "I worked as Web Developer using React, Redux, PostCss, Sass and Webpack as web technologies.",
  "experience.psl.2": "I developed reusable components in React using the new EcmaScript specifications and PostCss as CSS preprocessor.",
  "experience.psl.3": "I did some project structure changes in the projects to improve the scalability.",
  "experience.psl.4": "I used advanced testing techniques and automation and static code analysis.",
  "experience.psl.5": "I defined some of the strategies to handle and estructure the data in the web app.",
  "experience.psl.6": "I optimized the CSS and applied visual improvements defined by design team after a user experience research.",
  "experience.psl.7": "In the project I used/applied concepts and methodologies such ass Continuous Deployment, Box Model, CSS Module, WebComponents, Global State, Responsive Design and Scrum.",
  "experience.freelance": "Freelance",
  "experience.freelance.1": "I worked in a start-up project called TuPeludo.",
  "experience.freelance.2": "I developed a web app where the user looked for a dog walker service.",
  "experience.freelance.3": "I automated the register process for the dog walker.",
  "experience.freelance.4": "I developed many reusable components using Reactjs.",
  "experience.freelance.5": "My main tools were Reactjs, Sass, Redux and Firebase."
}
