{
  "about": "Hola soy Juanse, graduado como diseñador y desarrollador web de profesión,vivo en Sabaneta, Colombia. Creo que mis habilidades en desarrollo y conocimientos en diseño me hacen alguien capaz de trabajar muy bien con personas diseñadores y dar interactividad a las ideas mas creativas. Me gusta utilizar mis habilidades de desarrollo y conocimientos de diseño para crear paginas visualmente divertidas :D. Me gusta muchos trabajar en proyectos con mucho contenido multimedia donde escribir código de una forma elegante y eficiente.",
  "experience.huge": "Huge",
  "experience.huge.1": "Soy desarrollador web en proyectos para Google. Estoy encargado de mantener e implementar nuevos diseños para mejorar la experiencia de usuario en páginas y aplicaciones que reciben una gran cantidad de visitas diarias, conservando un mínimo de accesibilidad (AA) y alto nivel performance para poder llegar a usuarios en todo el mundo.",
  "experience.huge.2": "Desarrollo componentes para visualizar todo tipo de contenido multimedia.",
  "experience.huge.3": "Realizo pruebas de concepto para presentar propuestas al cliente.",
  "experience.huge.4": "He liderado estrategias de pruebas en las aplicaciones.",
  "experience.huge.5": "He reestructurado proyectos para mejorar la escalabilidad y mantenibilidad del proyecto",
  "experience.huge.6": "Mis herramientas mas utilizadas son HTML, CSS y JavaScript. En algunos proyectos también he hecho uso de Preact, una versión mas ligera y libre de Reactjs, TweenLite y Sass. También, participe en un proyecto que utilizaba Svelte un framework de JavaScript.",
  "experience.psl": "PSL",
  "experience.psl.1": "Trabaje como desarrollador web utilizando tecnologías como React, Redux, PostCss, Sass y Webpack. Mis herramientas principales son HTML, CSS y JavaScript con las que desarrolle soluciones para los clientes.",
  "experience.psl.2": "Desarrolle componentes reutilizares en React y PostCss.",
  "experience.psl.3": "Realice mejoras en la estructura de los proyectos para mejorar escalabilidad.",
  "experience.psl.4": "Aplique técnicas avanzadas de pruebas y automatización de análisis estático de código.",
  "experience.psl.5": "Contribuí a la definición del manejo y estructura de datos en una app.",
  "experience.psl.6": "Optimicé el uso de CSS y aplique las mejoras visuales del resultado de una investigación de experiencia de usuario hecho por el equipo de diseño.",
  "experience.psl.7": "En lFs proyectos aplique conceptos como Box Model, CSS Module, WebComponents, Global State, Responsive Design y las ulitmas especificaciones de JavaScript. Adicionalmente, trabaje con metodologías ágiles como Scrum.",
  "experience.freelance": "freelance",
  "experience.freelance.1": "Trabaje en proyectos de start ups como TuPeludo.",
  "experience.freelance.2": "Desarrollé una web donde los usuario podían solicitar un servicio de paseador de mascotas.",
  "experience.freelance.3": "Atomatice el proceso de registro de los paseadores de moscotas.",
  "experience.freelance.4": "Contrui componentes reutilizables usando Reactjs.",
  "experience.freelance.5": "Las herramientas principales de desarrollo eran Reactjs, Sass, Redux y Firebase."
}
