{
  "about": "Hola soy Juanse, graduado como diseñador y desarrollador web de profesión con más de 4 años de experiencia utilizando HTML, CSS y JavaScript como lenguajes de programación y maquinación, vivo en Sabaneta, Colombia. Tengo un conocimiento amplio de React, Redux, Webpack y el ecosistema al rededor de estas tecnologías. Tengo buenas habilidades de comunicación, un nivel de ingles avanzado y he trabajo en múltiples proyectos con metodologías como Scrum y Kanban. Mis habilidades en desarrollo y conocimientos de diseño me permiten llevar a la web diseños e ideas de mis compañeros y mias se me ocurren desde mis habilidades técnicas.",
  "nav.about": "Sobre mi",
  "nav.work": "Experiencia",
  "nav.contact": "Contacto",
  "download": "Hoja de vida",
  "experience.huge": "Huge",
  "experience.huge.1": "Soy desarrollador web en proyectos para Google. Estoy encargado de mantener e implementar nuevos diseños para mejorar la experiencia de usuario en páginas y aplicaciones que reciben una gran cantidad de visitas diarias, conservando un mínimo de accesibilidad (AA) y alto nivel performance para poder llegar a usuarios en todo el mundo.",
  "experience.huge.2": "Desarrollo componentes para visualizar todo tipo de contenido multimedia.",
  "experience.huge.3": "Realizo pruebas de concepto para presentar propuestas al cliente.",
  "experience.huge.4": "He liderado estrategias de pruebas en las aplicaciones.",
  "experience.huge.5": "He reestructurado proyectos para mejorar la escalabilidad y mantenibilidad del proyecto.",
  "experience.huge.6": "Mis herramientas más utilizadas son HTML, CSS y JavaScript. En algunos proyectos también he hecho uso de Preact, una versión mas ligera y libre de Reactjs, TweenLite y Sass",
  "experience.psl": "PSL",
  "experience.psl.1": "Trabajé como desarrollador web utilizando tecnologías como React, Redux, PostCss, Sass y Webpack.",
  "experience.psl.2": "Desarrollé componentes reutilizables en React utilizando las nuevas especificaciones de EcmaScript y PostCss como pre-procesador de CSS.",
  "experience.psl.3": "Realicé mejoras en la estructura de los proyectos para mejorar escalabilidad.",
  "experience.psl.4": "Apliqué técnicas avanzadas de pruebas y automatización de análisis estático de código.",
  "experience.psl.5": "Contribuí a la definición del manejo y estructura de datos en la aplicación web.",
  "experience.psl.6": "Optimicé el uso de CSS y aplique las mejoras visuales del resultado de una investigación de experiencia de usuario hecho por el equipo de diseño.",
  "experience.psl.7": "En los proyectos aplique/usé conceptos como Continuous Deployment, Box Model, CSS Module, WebComponents, Global State, Responsive Design y Scrum.",
  "experience.freelance": "Freelance",
  "experience.freelance.1": "Trabaje en un proyecto de start-up llamado TuPeludo.",
  "experience.freelance.2": "Desarrollé una web donde los usuario podían solicitar un servicio de paseador de mascotas.",
  "experience.freelance.3": "Atomaticé el proceso de registro de los paseadores de mascotas.",
  "experience.freelance.4": "Construí componentes reutilizables usando Reactjs.",
  "experience.freelance.5": "Mis principales de desarrollo fueron Reactjs, Sass, Redux y Firebase."
}
