{
  "about.1": "Hola soy Juanse, <strong>diseñador</strong> <emoji>👨‍🎨</emoji> y <strong>desarrollador web</strong> <emoji>👨‍💻</emoji> de profesión con más de 4 años de experiencia utilizando <strong>HTML</strong>, <strong>CSS</strong> y <strong>JavaScript</strong> como mis herramientas de trabajo <emoji>🛠</emoji>. Tengo un conocimiento actualizado de <strong>React</strong>, <strong>Redux</strong>, <strong>Webpack</strong> y el ecosistema al rededor de estas tecnologías",
  "about.2": "Tengo buenas habilidades de comunicación, un nivel de inglés avanzado <emoji>🤓</emoji> y he trabajo con metodologías como <strong>Scrum</strong> y <strong>Kanban</strong>. Mis habilidades en desarrollo y conocimientos de diseño me permiten convertir diseños e ideas creativas en producto digitales como web/aplicaciones. <emoji>🚀</emoji>",
  "nav.home": "Inicio",
  "nav.about": "Sobre mi",
  "nav.work": "Experiencia",
  "nav.contact": "Contacto",
  "nav.skip": "Saltar al contenido",
  "nav.top": "Ir arriba",
  "nav.dark": "Modo oscuro",
  "download": "Hoja de vida",
  "experience.lean": "Lean Tech",
  "experience.lean.1": "Trabajo como <strong>Sr. FrontEnd developer</strong> para <strong>Arrive</strong> (una compañía de logística). En el grupo creamos módulos y funcionalidades par una plataforma (una aplicación web) que es utilizada por los usuarios para gestionar el negocio.",
  "experience.lean.2": "Uno de los mayores retos es mantener a los clientes sincronizados en <strong>tiempo real</strong>  y notificar las actualizaciones de las cargas, transportadores, camiones y demás. ",
  "experience.lean.3": "Junto al equipo creamos un panel de notificaciones para mostrar las mejores opciones de carga para nuestros usuarios basados sus requerimientos en <strong>tiempo real</strong> .",
  "experience.lean.4": "Inicie un proyecto nuevo utilizando <strong>Webpack</strong>, <strong>React</strong>, <strong>TypeScript</strong>, <strong>Styled Components</strong>, <strong>Jest</strong>, <strong>Testing Library</strong> and <strong>Apollo Graphql</strong>",
  "experience.lean.5": "He liderado la estrategia de testing unitario y de integración.",
  "experience.lean.6": "Definí algunos de los <strong>estándares de código</strong>, <strong>naming</strong>, y <strong>arquitectura</strong> de nuestros proyectos.",
  "experience.lean.7": "Trabaje en la migración de un project de  <strong>Redux</strong> a <strong>Apollo Graphql</strong>",
  "experience.lean.8": "Utilizamos <strong>websocket</strong> y la infraestructura de <strong>Azure</strong> para procesar y sincronizar los clients, junto con  <strong>Okta</strong> para manejar el acceso aplicando permisos y reglas de negocio.",
  "experience.huge": "Huge",
  "experience.huge.1": "Trabajé como desarrollador web en proyectos para <strong>Google</strong>. Estaba encargado de <strong>mantener</strong> e <strong>implementar</strong> nuevos diseños para mejorar la <strong>experiencia de usuario</strong> en páginas y aplicaciones que reciben una gran cantidad de visitas diarias, conservando la <strong>accesibilidad</strong> y alto nivel <strong>rendimiento</strong> para poder llegar a usuarios en todo el mundo.",
  "experience.huge.2": "Desarrollé componentes para visualizar todo tipo de contenido multimedia.",
  "experience.huge.3": "Realicé pruebas de concepto para presentar propuestas al cliente.",
  "experience.huge.4": "Lideré estrategias de pruebas en las aplicaciones.",
  "experience.huge.5": "Reestructuré proyectos para mejorar la <strong>escalabilidad</strong> y <strong>mantenibilidad</strong> del proyecto.",
  "experience.huge.6": "Mis herramientas más utilizadas fueron <strong>HTML</strong>, <strong>CSS</strong> y <strong>JavaScript</strong>. En algunos proyectos hice uso de <strong>Preact</strong>, <strong>TweenLite</strong> y <strong>Sass</strong>.",
  "experience.psl": "PSL",
  "experience.psl.1": "Trabajé como desarrollador web utilizando tecnologías como <strong>React</strong>, <strong>Redux</strong>, <strong>PostCss</strong>, <strong>Sass</strong> y <strong>Webpack</strong>.",
  "experience.psl.2": "Desarrollé componentes reutilizables en <strong>React</strong> utilizando las nuevas especificaciones de <strong>EcmaScript</strong> y <strong>PostCss</strong> como pre-procesador de CSS.",
  "experience.psl.3": "Realicé mejoras en la estructura de los proyectos para mejorar <strong>escalabilidad</strong>.",
  "experience.psl.4": "Apliqué <strong>técnicas avanzadas de pruebas</strong> y automatización de análisis estático de código.",
  "experience.psl.5": "Contribuí a la definición del manejo y estructura de datos en la aplicación web.",
  "experience.psl.6": "Optimicé el uso de <strong>CSS</strong> y apliqué las mejoras visuales del resultado de una investigación de experiencia de usuario hecho por el equipo de diseño.",
  "experience.psl.7": "En los proyectos aplique/usé conceptos como <strong>Continuous Deployment</strong>, <strong>Box Model</strong>, <strong>CSS Module</strong>, <strong>WebComponents</strong>, <strong>Global State</strong>, <strong>Responsive Design</strong> y <strong>Scrum</strong>.",
  "experience.freelance": "Freelance",
  "experience.freelance.1": "Trabajé en un proyecto de start-up llamado TuPeludo.",
  "experience.freelance.2": "Desarrollé una <strong>aplicación web</strong> donde los usuario podían solicitar un servicio de paseador de mascotas.",
  "experience.freelance.3": "Atomaticé el proceso de registro de los paseadores de mascotas.",
  "experience.freelance.4": "Construí componentes reutilizables usando Reactjs.",
  "experience.freelance.5": "Mis principales herramientas de desarrollo fueron <strong>React</strong>, <strong>Sass</strong>, <strong>Redux</strong> y <strong>Firebase</strong>."
}
